app/views/students/show.html.erb

<h1><%= Student.find(params[:id]) %></h1>
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]